; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v1)
             (pred_12 ?v10 ?v11)
             (pred_11 ?v5 ?v11)
             (pred_9 ?v8 ?v5 )
	     (pred_8 ?v5)
             (pred_1 ?v6)
             (pred_5 ?v10)
             (pred_7 ?v11)
             (pred_3 ?v5)
             (pred_4 ?v10)
             (pred_2 ?v5)
             (pred_10 ))



(:action op_4
:parameters (?v9 ?v12 ?v2 ?v13)
:precondition (and (pred_1 ?v9) (pred_1 ?v12) (pred_5 ?v2) (pred_7 ?v13)
          (pred_6 ?v9 ?v12) (pred_12 ?v2 ?v13)
                   (pred_11 ?v12 ?v13) (pred_8 ?v9) 
                   (pred_3 ?v12) (pred_4 ?v2))
:effect (and  (pred_2 ?v12) (not (pred_3 ?v12))))


(:action op_3
:parameters (?v9 ?v7)
:precondition (and (pred_1 ?v9) (pred_1 ?v7)
               (pred_8 ?v9) (pred_6 ?v9 ?v7) (pred_2 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v9))))

(:action op_5
:parameters (?v9 ?v2)
:precondition (and (pred_1 ?v9) (pred_5 ?v2) 
                  (pred_8 ?v9) (pred_9 ?v2 ?v9) (pred_10 ))
:effect (and (pred_4 ?v2)
   (not (pred_9 ?v2 ?v9)) (not (pred_10 ))))


(:action op_2
:parameters (?v9 ?v3 ?v4)
:precondition (and (pred_1 ?v9) (pred_5 ?v3) (pred_5 ?v4)
                  (pred_8 ?v9) (pred_4 ?v4) (pred_9 ?v3 ?v9))
:effect (and (pred_4 ?v3) (pred_9 ?v4 ?v9)
        (not (pred_4 ?v4)) (not (pred_9 ?v3 ?v9))))

(:action op_1
:parameters (?v9 ?v2)
:precondition (and (pred_1 ?v9) (pred_5 ?v2) 
                  (pred_8 ?v9) (pred_4 ?v2))
:effect (and (pred_10 ) (pred_9 ?v2 ?v9) (not (pred_4 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_06 obj_13 obj_02 obj_07 obj_20 obj_12 obj_18 obj_09 obj_10 obj_14 obj_04 obj_05 obj_01 obj_08 obj_17
    obj_16 obj_19
    obj_15 obj_11
    )

    (:init
       (pred_10)

       (pred_1 obj_03)
       (pred_1 obj_06)
       (pred_1 obj_13)
       (pred_1 obj_02)
       (pred_1 obj_07)
       (pred_1 obj_20)
       (pred_1 obj_12)
       (pred_1 obj_18)
       (pred_1 obj_09)
       (pred_1 obj_10)
       (pred_1 obj_14)
       (pred_1 obj_04)
       (pred_1 obj_05)
       (pred_1 obj_01)
       (pred_1 obj_08)
       (pred_1 obj_17)
       (pred_7 obj_16)
       (pred_7 obj_19)
       (pred_5 obj_15)
       (pred_5 obj_11)

       (pred_6 obj_03 obj_07)
       (pred_6 obj_03 obj_06)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_03)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_02)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_02 obj_18)
       (pred_6 obj_02 obj_13)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_20 obj_10)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_12 obj_14)
       (pred_6 obj_12 obj_18)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_18 obj_02)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_09 obj_05)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_20)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_04)
       (pred_6 obj_14 obj_12)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_04 obj_17)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_04 obj_14)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_09)
       (pred_6 obj_01 obj_08)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_17 obj_04)
       (pred_6 obj_17 obj_08)
       (pred_3 obj_09)
       (pred_3 obj_03)
       (pred_11  obj_09 obj_16)
       (pred_11  obj_03 obj_19)
       (pred_2 obj_06)
       (pred_2 obj_13)
       (pred_2 obj_02)
       (pred_2 obj_07)
       (pred_2 obj_20)
       (pred_2 obj_12)
       (pred_2 obj_18)
       (pred_2 obj_10)
       (pred_2 obj_14)
       (pred_2 obj_04)
       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_08)
       (pred_2 obj_17)

       (pred_12  obj_15 obj_16)
       (pred_12  obj_11 obj_19)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_11 obj_17)
       (pred_8 obj_20)
    )

    (:goal (and
       (pred_9 obj_15 obj_07)
       (pred_9 obj_11 obj_06)
    ))
(:constraints
  (always (not (pred_8 obj_04)))
)
)

; plan
1. (op_3 obj_20 obj_10)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_10)
   goals met: 0 of 2
2. (op_3 obj_10 obj_01)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_01)
   goals met: 0 of 2
3. (op_3 obj_01 obj_08)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_08)
   goals met: 0 of 2
4. (op_3 obj_08 obj_17)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_17)
   goals met: 0 of 2
5. (op_5 obj_17 obj_15)
   deleted: (pred_9 obj_15 obj_17) (pred_10)
   added: (pred_4 obj_15)
   goals met: 0 of 2
6. (op_3 obj_17 obj_08)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_08)
   goals met: 0 of 2
7. (op_3 obj_08 obj_01)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_01)
   goals met: 0 of 2
8. (op_3 obj_01 obj_10)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_10)
   goals met: 0 of 2
9. (op_3 obj_10 obj_20)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_20)
   goals met: 0 of 2
10. (op_3 obj_20 obj_07)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_07)
   goals met: 0 of 2
11. (op_1 obj_07 obj_15)
   deleted: (pred_4 obj_15)
   added: (pred_10) (pred_9 obj_15 obj_07)
   goals met: 1 of 2
12. (op_3 obj_07 obj_20)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_20)
   goals met: 1 of 2
13. (op_3 obj_20 obj_10)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_10)
   goals met: 1 of 2
14. (op_3 obj_10 obj_14)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_14)
   goals met: 1 of 2
15. (op_3 obj_14 obj_08)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_08)
   goals met: 1 of 2
16. (op_3 obj_08 obj_17)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_17)
   goals met: 1 of 2
17. (op_5 obj_17 obj_11)
   deleted: (pred_9 obj_11 obj_17) (pred_10)
   added: (pred_4 obj_11)
   goals met: 1 of 2
18. (op_3 obj_17 obj_08)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_08)
   goals met: 1 of 2
19. (op_3 obj_08 obj_14)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_14)
   goals met: 1 of 2
20. (op_3 obj_14 obj_12)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_12)
   goals met: 1 of 2
21. (op_3 obj_12 obj_13)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_13)
   goals met: 1 of 2
22. (op_3 obj_13 obj_06)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_06)
   goals met: 1 of 2
23. (op_1 obj_06 obj_11)
   deleted: (pred_4 obj_11)
   added: (pred_10) (pred_9 obj_11 obj_06)
   goals met: 2 of 2
